# Pandas

In [41]:
import pandas as pd 
import numpy as np

## A. Series

Series adalah tabel dengan 1 kolom

In [21]:
x = np.array([1,2,3,4,5,6,7,8,9])
y = pd.Series(x)
y

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

Memanggil indeks ke-0

In [17]:
y[0]

1

In [18]:
x = ['Andi','Budi','Caca']
y = pd.Series(x)
y

0    Andi
1    Budi
2    Caca
dtype: object

In [20]:
y[1:3]

1    Budi
2    Caca
dtype: object

In [25]:
x = [1,2,3,4,5]
y = pd.Series(data = np.array(x), index = ['a','b','c','d','e']) #memberi keterangan index
y

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [24]:
y['d']

4

In [26]:
x = [1,2,3,4,5]
y = pd.Series(
    data = np.array(x), 
    index = ['a','b','c','d','e'],
    name = 'Test')
y

a    1
b    2
c    3
d    4
e    5
Name: Test, dtype: int32

In [28]:
y = pd.Series(
    data = {'Andi':100, 'Budi':80},
    name = 'Hasil Test')
y

Andi    100
Budi     80
Name: Hasil Test, dtype: int64

## B. DataFrame

In [33]:
x = np.array([1,2,3,4,5,6,7,8,9])
df = pd.DataFrame(x, columns=['Nilai'])
df

   Nilai
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9

In [37]:
baris, kolom = df.shape # (9,1): ada 9 baris, 1 kolom
baris

9

In [42]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
df = pd.DataFrame([x,y])
df

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [44]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
df = pd.DataFrame(np.hstack([x,y]))
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [47]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
z = (map(lambda a, b: [a, b], x, y))
z = list(z)
df = pd.DataFrame(z)
df

   0   1
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [6]:
xDataFrame = pd.DataFrame([[1,2],[3,4],[4,5]], columns=['A','B'])

#data paling atas
xDataFrame.head(1)

   A  B
0  1  2

In [7]:
#data paling bawah
xDataFrame.tail(1)

   A  B
2  4  5

In [9]:
#menampilkan series "A"
xDataFrame['A']

0    1
1    3
2    4
Name: A, dtype: int64

In [50]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
z = 'David','Andi','Budi','Caca','Euis'

df = pd.DataFrame()
df['X'] = x
df['Y'] = y
df['Z'] = z
df

   X   Y      Z
0  1   6  David
1  2   7   Andi
2  3   8   Budi
3  4   9   Caca
4  5  10   Euis

In [53]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
z = list('David')

df = pd.DataFrame()
df['X'] = x
df['Y'] = y
df['Z'] = z
df

   X   Y  Z
0  1   6  D
1  2   7  a
2  3   8  v
3  4   9  i
4  5  10  d

In [54]:
x = [1,2,3,4,5]
y = [6,7,8,9,10]
z = 'David'

df = pd.DataFrame()
df['X'] = x
df['Y'] = y
df['Z'] = z
df

   X   Y      Z
0  1   6  David
1  2   7  David
2  3   8  David
3  4   9  David
4  5  10  David

In [74]:
data = [
    ['Andi', 'Jakarta', 'PNS'],
    ['Budi', 'Jakarta', 'Karyawan Swasta'],
    ['Caca', 'Jakarta', 'Ibu Rumah Tangga'],
]
dfData = pd.DataFrame(
    data,
    index = np.arange(1,len(data)+1),
    columns = ['Nama','Kota','Pekerjaan']
)
dfData

   Nama     Kota         Pekerjaan
1  Andi  Jakarta               PNS
2  Budi  Jakarta   Karyawan Swasta
3  Caca  Jakarta  Ibu Rumah Tangga

In [67]:
data = [
    ['Andi', 'Jakarta', 'PNS'],
    ['Budi', 'Jakarta', 'Karyawan Swasta'],
    ['Caca', 'Jakarta', 'Ibu Rumah Tangga'],
]
dfData = pd.DataFrame(
    data,
    index = list('abc'),
    columns = ['Nama','Kota','Pekerjaan']
)
dfData

   Nama     Kota         Pekerjaan
a  Andi  Jakarta               PNS
b  Budi  Jakarta   Karyawan Swasta
c  Caca  Jakarta  Ibu Rumah Tangga

**DataFrame dari Dictionary**

In [71]:
data = {
    'x':[123,321,213],
    'y':[213,421,613],
    'z':[923,621,713],
}

df = pd.DataFrame(data)
df

     x    y    z
0  123  213  923
1  321  421  621
2  213  613  713

In [72]:
df.shape

(3, 3)

**DataFrame dari List berisi Dictionary**

In [77]:
data = [
    {'nama':'Andi', 'kota':'Jakarta'},
    {'nama':'Budi', 'kota':'Jakarta'},
    {'nama':'Caca', 'kota':'Jakarta', 'Job':'Ibu Rumah Tangga'},
]
df = pd.DataFrame(data)
df

   nama     kota               Job
0  Andi  Jakarta               NaN
1  Budi  Jakarta               NaN
2  Caca  Jakarta  Ibu Rumah Tangga

**DataFrame dari Series**

In [88]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(x, name='Try')
df = pd.DataFrame([x,y])
df

      0  1  2  3  4
Test  1  2  3  4  5
Try   1  2  3  4  5

In [89]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(x, name='Try')
df = pd.DataFrame([x,y])
df.transpose()

   Test  Try
0     1    1
1     2    2
2     3    3
3     4    4
4     5    5

In [90]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(x, name='Try')
df = pd.DataFrame({
    x.name : x,
    y.name : y
})
df

   Test  Try
0     1    1
1     2    2
2     3    3
3     4    4
4     5    5

In [155]:
df = pd.DataFrame({
    'A': [32, 4, 12, 21, 21, 21],
    'B': np.arange(20,26),
    'C': np.random.rand(6),
    'D': np.ones(6)
}, index = list('abcdef'))
df

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0
c  12  22  0.768488  1.0
d  21  23  0.272643  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0

In [177]:
df.head(2)

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0

In [178]:
df.head(-2)

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0
c  12  22  0.768488  1.0
d  21  23  0.272643  1.0

In [179]:
df.tail(2)

    A   B         C    D
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0

In [180]:
df.tail(-2)

    A   B         C    D
c  12  22  0.768488  1.0
d  21  23  0.272643  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0

In [181]:
df.shape

(6, 4)

In [182]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [183]:
list(df.index)

['a', 'b', 'c', 'd', 'e', 'f']

In [184]:
list(df.columns)

['A', 'B', 'C', 'D']

In [185]:
np.array(df.columns)

array(['A', 'B', 'C', 'D'], dtype=object)

In [186]:
df.values

array([[32.        , 20.        ,  0.45713218,  1.        ],
       [ 4.        , 21.        ,  0.84615756,  1.        ],
       [12.        , 22.        ,  0.76848787,  1.        ],
       [21.        , 23.        ,  0.27264284,  1.        ],
       [21.        , 24.        ,  0.57972525,  1.        ],
       [21.        , 25.        ,  0.69243847,  1.        ]])

In [187]:
df.describe()

               A          B         C    D
count   6.000000   6.000000  6.000000  6.0
mean   18.500000  22.500000  0.602764  1.0
std     9.523655   1.870829  0.212351  0.0
min     4.000000  20.000000  0.272643  1.0
25%    14.250000  21.250000  0.487780  1.0
50%    21.000000  22.500000  0.636082  1.0
75%    21.000000  23.750000  0.749476  1.0
max    32.000000  25.000000  0.846158  1.0

In [188]:
df['A']

a    32
b     4
c    12
d    21
e    21
f    21
Name: A, dtype: int64

In [189]:
df['A'].values

array([32,  4, 12, 21, 21, 21], dtype=int64)

In [190]:
df['A'].describe()

count     6.000000
mean     18.500000
std       9.523655
min       4.000000
25%      14.250000
50%      21.000000
75%      21.000000
max      32.000000
Name: A, dtype: float64

In [191]:
df.sort_index()

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0
c  12  22  0.768488  1.0
d  21  23  0.272643  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0

In [192]:
# MENGURUTKAN
df.sort_index(ascending=False)

    A   B         C    D
f  21  25  0.692438  1.0
e  21  24  0.579725  1.0
d  21  23  0.272643  1.0
c  12  22  0.768488  1.0
b   4  21  0.846158  1.0
a  32  20  0.457132  1.0

In [193]:
#MEMBALIK URUTAN BY ROW/BARIS
df.sort_index(ascending=False, axis=0)

    A   B         C    D
f  21  25  0.692438  1.0
e  21  24  0.579725  1.0
d  21  23  0.272643  1.0
c  12  22  0.768488  1.0
b   4  21  0.846158  1.0
a  32  20  0.457132  1.0

In [194]:
#MEMBALIK URUTAN BY COLUMN
df.sort_index(ascending=False, axis=1)

     D         C   B   A
a  1.0  0.457132  20  32
b  1.0  0.846158  21   4
c  1.0  0.768488  22  12
d  1.0  0.272643  23  21
e  1.0  0.579725  24  21
f  1.0  0.692438  25  21

In [195]:
# Cara alternatif buat assign value (df)
df.sort_index(ascending=True, axis=1, inplace=True)
df

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0
c  12  22  0.768488  1.0
d  21  23  0.272643  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0

In [196]:
#MENGURUTKAN BERDASARKAN NILAI C
df.sort_values(by='C')

    A   B         C    D
d  21  23  0.272643  1.0
a  32  20  0.457132  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0
c  12  22  0.768488  1.0
b   4  21  0.846158  1.0

In [197]:
#MEMBALIKKAN URUTAN NILAI C
df.sort_values(by='C', ascending=False)

    A   B         C    D
b   4  21  0.846158  1.0
c  12  22  0.768488  1.0
f  21  25  0.692438  1.0
e  21  24  0.579725  1.0
a  32  20  0.457132  1.0
d  21  23  0.272643  1.0

In [198]:
#MEMBALIKKAN URUTAN NILAI A dan B
df.sort_values(by=['A','B'], ascending=False)

    A   B         C    D
a  32  20  0.457132  1.0
f  21  25  0.692438  1.0
e  21  24  0.579725  1.0
d  21  23  0.272643  1.0
c  12  22  0.768488  1.0
b   4  21  0.846158  1.0

In [199]:
#MEMBALIKKAN URUTAN NILAI A dan B
df.sort_values(by=['A','B'], ascending=[False, True])

    A   B         C    D
a  32  20  0.457132  1.0
d  21  23  0.272643  1.0
e  21  24  0.579725  1.0
f  21  25  0.692438  1.0
c  12  22  0.768488  1.0
b   4  21  0.846158  1.0

In [201]:
df[['A','B']]

    A   B
a  32  20
b   4  21
c  12  22
d  21  23
e  21  24
f  21  25

In [203]:
df[['A','D','C','B']]

    A    D         C   B
a  32  1.0  0.457132  20
b   4  1.0  0.846158  21
c  12  1.0  0.768488  22
d  21  1.0  0.272643  23
e  21  1.0  0.579725  24
f  21  1.0  0.692438  25

In [205]:
#MEMANGGIL INDEX KE:0 DAN 1
df[0:2]

    A   B         C    D
a  32  20  0.457132  1.0
b   4  21  0.846158  1.0

In [206]:
df[0::2]

    A   B         C    D
a  32  20  0.457132  1.0
c  12  22  0.768488  1.0
e  21  24  0.579725  1.0

In [215]:
df = pd.DataFrame({
    'A': [32, 4, 12, 21, 21, 21],
    'B': np.arange(20,26),
    'C': np.random.rand(6),
    'D': np.ones(6)
})
df

    A   B         C    D
0  32  20  0.392565  1.0
1   4  21  0.275492  1.0
2  12  22  0.194223  1.0
3  21  23  0.606157  1.0
4  21  24  0.679583  1.0
5  21  25  0.782246  1.0

## Menampilkan Data Tertentu dalam DataFrame

In [210]:
#MENAMPILKAN SELURUH DATA BERDASARKAN NAMA BARIS 0
df.loc[0]

A    32.00000
B    20.00000
C     0.24232
D     1.00000
Name: 0, dtype: float64

In [211]:
#MENAMPILKAN DATA BERDASARKAN NAMA BARIS '0', KOLOM 'A'
df.loc[1, 'A']

4

In [212]:
#MENAMPILKAN DATA BY NAME OF COLUMN
df.loc[1, ['A','B']]

A     4.0
B    21.0
Name: 1, dtype: float64

In [217]:
df.loc[0:2]

    A   B         C    D
0  32  20  0.392565  1.0
1   4  21  0.275492  1.0
2  12  22  0.194223  1.0

In [218]:
#MEMANGGIL DATA BERDASARKAN INDEX
df.iloc[0]

A    32.000000
B    20.000000
C     0.392565
D     1.000000
Name: 0, dtype: float64

In [219]:
df.iloc[-1]

A    21.000000
B    25.000000
C     0.782246
D     1.000000
Name: 5, dtype: float64

In [236]:
df = pd.DataFrame({
    'A': [32, 4, 12, 21, 21, 21],
    'B': np.arange(20,26),
    'C': np.random.rand(6),
    'D': np.ones(6)
})
df.index = list('abcdef')
df.columns = ['Nama','Nilai','Value','Ranking']
df

   Nama  Nilai     Value  Ranking
a    32     20  0.689364      1.0
b     4     21  0.025657      1.0
c    12     22  0.175550      1.0
d    21     23  0.204399      1.0
e    21     24  0.887549      1.0
f    21     25  0.780540      1.0

In [232]:
df.iloc[3:5, 0:3] #menampilkan baris ke-3-4, kolom ke-0,1,2

    A   B         C
d  21  23  0.287727
e  21  24  0.840258

In [239]:
#Menampilkan data dg step 2, diurutkan berdasarkan nilai dan value, lalu data yang ditampilkan hanya nama dan nilai
df.iloc[::2].sort_values(
    by = ['Nilai','Value'],
    ascending = [False, True]
)[['Nama','Nilai']]

   Nama  Nilai
e    21     24
c    12     22
a    32     20

### Menjadikan A sebagai Index, tanpa menghilangkan kolom A

In [222]:
df = pd.DataFrame({
    'A': [32, 4, 12, 21, 21, 21],
    'B': np.arange(20,26),
    'C': np.random.rand(6),
    'D': np.ones(6)
})

df.index = df['A']
df

     A   B         C    D
A
32  32  20  0.641434  1.0
4    4  21  0.827248  1.0
12  12  22  0.954813  1.0
21  21  23  0.675392  1.0
21  21  24  0.211151  1.0
21  21  25  0.570179  1.0

In [223]:
# menjadikan kolom sebagai index => mirip pivot di Excel, tapi A hilang
df = df.set_index('A')
df

     B         C    D
A
32  20  0.641434  1.0
4   21  0.827248  1.0
12  22  0.954813  1.0
21  23  0.675392  1.0
21  24  0.211151  1.0
21  25  0.570179  1.0

## C. Mengakses Data dari File CSV

In [241]:
mydf = pd.read_csv('data.csv')
mydf

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi  Bandung
2   3  Caca  Jakarta

In [242]:
df = pd.read_excel('data.xlsx')
df

   no  nama      kota
0   1  Andi   Jakarta
1   2  Budi  Surabaya
2   3  Caca   Bandung

In [244]:
df = pd.read_json('data.json')
df[['nama','kota']]

   nama     kota
0  Andi  Jakarta
1  Budi    Yogya
2  Caca    Depok

Create dataframe:
-    csv
-    excel
-    json

tanpa pd.read_XXX
    
Create dataframe:
    db mysql
    db mongodb
    tanpa pd.read_Sql